#pragma once
#include <iostream>
#include <sstream>
#include <string>
#include <algorithm>

class Morse {
private :
	std::string alphabet[26][2] = {	//알파벳
		{ "a" , ".-" } , { "b" , "-..." } , { "c" , "-.-." } , { "d" , "-.." } , { "e" , "." } , { "f" , "..-."} , { "g" , "--." } , { "h" , "...." },
		{ "i" , ".." } , { "j" , ".---" } , { "k" , "-.-" } , { "l" , ".-.." } , { "m" , "--" } , { "n" , "-." } , { "o" , "---" } , { "p" , ".--."},
		{ "q" , "--.-" } , { "r" , ".-." } , { "s" , "..." } , { "t" , "-" } , { "u" , "..-" } , { "v" , "...-" } , { "w" , ".--" } , { "x" , "-..-" },
		{ "y" , "-.--" } , { "z" , "--.." } };

	std::string digit[10][2] = {	//숫자
		{ "0" , "-----" } , { "1" , ".----" } , { "2" , "..---" } , { "3" , "...--"} , { "4" , "....-"} , { "5" , "....." } ,
		{ "6" , "-...." } , { "7" , "--..." } , { "8" , "---.." } , { "9" , "----." } };

	std::string symbol[7][2] = {	//특수문자
		{ "/" , "-..-." } , { "?" , "..--.." } , { "," , "--..--" } , { "." , ".-.-.-"} , { "+" , ".-.-."} , { "=" , "-...-"} , { " " , "   "} };
public :
	Morse() { std::cout << "아래에 영문 텍스트를 입력하세요. 모스 부호로 바뀝니다." << std::endl; };
	void txt2morse(std::string text ,std::string &morse);
	bool morse2txt(std::string morse, std::string &text);
};